# Функция get_mask_card_number:
# Тестирование правильности маскирования номера карты.
# Проверка работы функции на различных входных форматах номеров карт,
# включая граничные случаи и нестандартные длины номеров.
# Проверка, что функция корректно обрабатывает входные строки, где отсутствует номер карты.

# Функция get_mask_account:
# Тестирование правильности маскирования номера счета.
# Проверка работы функции с различными форматами и длинами номеров счетов.
# Проверка, что функция корректно обрабатывает входные данные, где номер счета меньше ожидаемой длины.