
# Функция filter_by_state:
# Тестирование фильтрации списка словарей по заданному статусу state.
# Проверка работы функции при отсутствии словарей с указанным статусом
# state в списке.
# Параметризация тестов для различных возможных значений статуса
# state.
#
# Функция sort_by_date:
# Тестирование сортировки списка словарей по датам в порядке убывания и возрастания.
# Проверка корректности сортировки при одинаковых датах.
# Тесты на работу функции с некорректными или нестандартными форматами дат.